KmrAuthenticationWS/src/conf/xml-resources/web-service-references/MSCAuthenticationService/wsdl/MSCAuthenticationService.wsdl

<?xml version="1.0" encoding="UTF-8"?><!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.1.3.3-hudson-757-SNAPSHOT. --><!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.1.3.3-hudson-757-SNAPSHOT. --><definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://service.util.medsphere.org/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://service.util.medsphere.org/" name="MSCAuthenticationService">
<types>
<xsd:schema>
<xsd:import namespace="http://service.util.medsphere.org/" schemaLocation="http://kmrdev.medsphere.com:8080/MSCServiceApp/MSCAuthenticationService?xsd=1"></xsd:import>
</xsd:schema>
</types>
<message name="ValidateAuthenticationInformation">
<part name="parameters" element="tns:ValidateAuthenticationInformation"></part>
</message>
<message name="ValidateAuthenticationInformationResponse">
<part name="parameters" element="tns:ValidateAuthenticationInformationResponse"></part>
</message>
<portType name="AuthenticationService">
<operation name="ValidateAuthenticationInformation">
<input message="tns:ValidateAuthenticationInformation"></input>
<output message="tns:ValidateAuthenticationInformationResponse"></output>
</operation>
</portType>
<binding name="AuthenticationServicePortBinding" type="tns:AuthenticationService">
<soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"></soap:binding>
<operation name="ValidateAuthenticationInformation">
<soap:operation soapAction="ValidateAuthenticationInformation"></soap:operation>
<input>
<soap:body use="literal"></soap:body>
</input>
<output>
<soap:body use="literal"></soap:body>
</output>
</operation>
</binding>
<service name="MSCAuthenticationService">
<port name="AuthenticationServicePort" binding="tns:AuthenticationServicePortBinding">
<soap:address location="http://kmrdev.medsphere.com:8080/MSCServiceApp/MSCAuthenticationService"></soap:address>
</port>
</service>
</definitions>