KmrAuthenticationWS/test/samples/sampleValidateRequest.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
	<SOAP-ENV:Body>
		<m:ValidateAuthenticationInformation xmlns:m="http://service.util.medsphere.org/">

         <!--
         ==============
           arg0:  DUZ
           arg1:  Token
         ==============
         -->
			<arg0>40056</arg0>
			<arg1>gmfhguiy8itym3</arg1>
		</m:ValidateAuthenticationInformation>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
